
"""
[summary]
Author: XIE DA NI (xiedani@poweroak.net)
Created: 2025-07-25
"""

#!------------------------------------------------------------------------------
#!                            1-100相加
#!------------------------------------------------------------------------------  
# 需求 ：1-100数字累加和 -- 1 + 2 + 3 + 4......100 = 结果，打印结果

"""
1. 准备做加法运算的数据1-100, 增量为1
2. 准备变量保存将来运算的结果
3. 循环做加法运算
4. 打印结果
5. 验证结果的正确性
"""

# 准备数据
i = 1

# 结果变量
result = 0

# 循环
while i <= 100:
    # 加法运算，前两个数的结果 + 第3个数 ————每计算一次加法则更新一次result变量值
    result = result + i
    i += 1

# 打印最终结果
print(result)


#!------------------------------------------------------------------------------
#!                            1-100偶数累加和--推荐这个用法
#!------------------------------------------------------------------------------  
# 需求 ：1-100数字偶数累加求和 -- 2+4+......100 = 结果，打印结果

"""
1. 准备要累加的数字, 开始1 结束100 增量1
2. 准备保存结果的变量result
3. 循环加法运算 -- 结果是偶数才加法运算 --和2取余数为0
4. 输出结果
5. 验证结果的正确性
"""

i = 1
result = 0
while i <= 100:
    # 条件语句 --if
    if i % 2 == 0:
        # 加法运算
        result += i 
    i += 1
#输出结果
print(result)

#!------------------------------------------------------------------------------
#!                            1-100偶数累加和--另一种方法
#!------------------------------------------------------------------------------  

# 计数器控制，让偶数累加
"""
1. 准备累加的数据
2. 准备存储的变量
3. 循环计算
4. 输出结果
"""

i = 2
result = 0
while i <= 100:
    result += i
    i += 2
print(result)