"""
[summary]
Author: XIE DA NI (xiedani@poweroak.net)
Created: 2025-07-25
"""

#!------------------------------------------------------------------------------
#!                          break
#!------------------------------------------------------------------------------ 
# break： 当某些条件或成立，退出整个循环
# 循环吃5个苹果，吃完第3个吃饱了，第4个第5个不吃了（不执行）-- ==4 或者 >3

i = 1
while i <= 5:
    #条件，如果迟到4或大于3
    if i == 4:
        print('吃饱了，不吃了')
        break
    print(f'吃了第{i}个苹果')
    i += 1

#!------------------------------------------------------------------------------
#!                          continue
#!------------------------------------------------------------------------------ 
# continue:当前条件成立，退出当前一次循环，继而执行下一次循环
# 吃五个苹果，--循环：吃到了3个苹果吃出虫子，没吃饱，继续吃第四个第五个

i = 1
while i <= 5:
    # 条件
    if i == 3:
        print('吃出虫子，这个苹果不吃了')
        #如果试用continue，在continue之前一定要修改计数器，否则进入死循环
        i += 1
        continue
    print(f'吃了第{i}个苹果')
    i += 1


