"""
[summary] 认识bug
Author: XIE DA NI (xiedani@poweroak.net)
Created: 2025-07-23
"""

#!------------------------------------------------------------------------------
#!                           认识bug
#!------------------------------------------------------------------------------

my_name = 'Rok'  # 定义变量
print(my_name)  # 输出正确变量内容  


myName = '超能程序员'
print(myname)  # 输出bug

print('myName') 
myName = '超能程序员'  # 顺序错误

#!------------------------------------------------------------------------------
#!                           Debug
#!------------------------------------------------------------------------------

my_name = 'Rok'  # 定义变量
print(my_name)  # 输出正确变量内容 
