"""
[summary] 
1.准备数据
2.格式化输出数据
Author: XIE DA NI (xiedani@poweroak.net)
Created: 2025-07-23
"""

#!------------------------------------------------------------------------------
#!                              格式化输出
#!-----------------------------------------------------------------------------
age = 28
name = 'XIE DA NI'
weight = 59
stu_id = 1
stu_id1 = 1000
print('今年我%d岁'% age)  # 格式化输出整数 %d

print('我的名字是%s' % name)  # 格式化输出字符串 %s

print('我的体重是%.2f' % weight)  # 格式化输出浮点数%f, %.2f表示保留两位小数

print('我的学号为%d' % stu_id)  # 格式化输出整数 %d

print('我的学号为%03d' % stu_id)  # 格式化输出整数 %d，%03d表示不足3位前面补0

print('我的学号为%03d' % stu_id1)  # 格式化输出整数 %d，%03d表示不足3位前面补0

# 5. 我的名字是XIE DA NI，我今年X岁
print('我的名字为%s, 今年%d岁' % (name, age))
print('我的名字为%s, 今年%d岁' % (name, age + 1))  

# 6. 我的名字是XIE DA NI，我今年X岁，我的体重是X斤，我的身高是X厘米

print('我的名字是%s，我今年%d岁，我的体重是%.2f斤，我的学号是%03d' % (name, age, weight, stu_id1))