"""
[summary] 
if 嵌套语句
Author: XIE DA NI (xiedani@poweroak.net)
Created: 2025-07-23
"""

#!------------------------------------------------------------------------------
#!                            if嵌套语句
#!------------------------------------------------------------------------------  

# 坐公交车：如果有钱可以上车，没有钱不能上车 ，如果上车了，判断能否坐下--是否有空座位？

"""
1. 准备将来要做判断的数据，钱和空座
2. 判断是否有钱：有钱上车，没钱不能上车
3. 上车了，判断是否能坐下?有空座，无座
"""

money = 1
seat = 1

if money == 1:
    print('土豪请上车')
    if seat == 1:
        print('有空座，请坐下')
    else:
        print('没有空座，站着等')
else:
    print('朋友，没带钱，跟着跑，跑快点')